-- --------------------------------------------------------
-- Хост:                         127.0.0.1
-- Версия сервера:               8.0.24 - MySQL Community Server - GPL
-- Операционная система:         Win64
-- HeidiSQL Версия:              11.3.0.6295
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

-- Дамп структуры для таблица survey.subject
CREATE TABLE IF NOT EXISTS `subject` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `education_level` varchar(10) NOT NULL,
  `educational_form` varchar(10) NOT NULL,
  `lecturer` varchar(50) NOT NULL,
  `speciality` varchar(255) NOT NULL,
  `title` varchar(255) NOT NULL,
  `year` smallint NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=103 DEFAULT CHARSET=utf8mb3;

-- Дамп данных таблицы survey.subject: ~0 rows (приблизительно)
/*!40000 ALTER TABLE `subject` DISABLE KEYS */;
REPLACE INTO `subject` (`id`, `education_level`, `educational_form`, `lecturer`, `speciality`, `title`, `year`) VALUES
	(1, 'Бакалавр', 'Денна', 'Лебідь О.Ю.', 'Обліково-аналітичне забезпеченн', 'ВИЩА МАТЕМАТИКА ДЛЯ УПРАВЛІНЦІВ', 2022),
	(2, 'Бакалавр', 'Денна', 'Маляр Д.В.', 'Обліково-аналітичне забезпеченн', 'МІКРОЕКОНОМІКА', 2022),
	(3, 'Бакалавр', 'Денна', 'Літвінов В.В.', 'Обліково-аналітичне забезпеченн', 'ПРИКЛАДНА КУЛЬТУРОЛОГІЯ', 2022),
	(4, 'Бакалавр', 'Денна', 'Запорожченко Ю.В.', 'Обліково-аналітичне забезпеченн', 'ІСТОРІЯ УКРАЇНСЬКОЇ ДЕРЖАВНОСТІ', 2022),
	(5, 'Бакалавр', 'Денна', 'Бабенко Л.В.', 'Обліково-аналітичне забезпеченн', 'ВСТУП ДО СПЕЦІАЛЬНОСТІ', 2022),
	(6, 'Бакалавр', 'Денна', 'Бузоверя А.Г.', 'Обліково-аналітичне забезпеченн', 'ФІЗИЧНЕ ВИХОВАННЯ (СПЕЦПІДГОТОВКА)', 2022),
	(7, 'Бакалавр', 'Денна', 'Білова Н.А.', 'Обліково-аналітичне забезпеченн', 'ЕКОЛОГ.БЕЗПЕКА ТА БЖД', 2022),
	(8, 'Бакалавр', 'Денна', 'Ковтун Н.С.', 'Обліково-аналітичне забезпеченн', 'ОСНОВИ ЕКОНОМ. ТЕОРІЇ', 2022),
	(9, 'Бакалавр', 'Денна', 'Бабенко Л.В.', 'Обліково-аналітичне забезпеченн', 'ЕКОНОМІКА ТА ФІНАНСИ ПІДПРИЄМСТВ', 2022),
	(10, 'Бакалавр', 'Денна', 'Корх О.М.', 'Обліково-аналітичне забезпеченн', 'ФІЛОСОФІЯ', 2022),
	(11, 'Бакалавр', 'Денна', 'Бабенко Л.В.', 'Обліково-аналітичне забезпеченн', 'Б У Х Г А Л Т Е Р С Ь К И Й О Б Л І К', 2021),
	(12, 'Бакалавр', 'Денна', 'Тополенко Н.М.', 'Обліково-аналітичне забезпеченн', 'Д О К У М Е Н Т У В А Н Н Я В О Б Л І К У', 2021),
	(13, 'Бакалавр', 'Денна', 'Тополенко Н.М.', 'Обліково-аналітичне забезпеченн', 'ОБЛІК І ОПОДАТКУВАННЯ В ГАЛУЗЯХ НАРОДНОГО ГОСПОДАРСТВА', 2021),
	(14, 'Бакалавр', 'Денна', 'Дубицький Д.П.', 'Обліково-аналітичне забезпеченн', 'ІНФОРМ. СИС. І ТЕХН. В ОБЛІКУ ТА АУД.', 2021),
	(15, 'Бакалавр', 'Денна', 'Кондратенко В.В.', 'Обліково-аналітичне забезпеченн', 'Ф І З И Ч Н Е В И Х О В А Н Н Я (С П Е Ц П І Д Г О Т О В К А )', 2021),
	(16, 'Бакалавр', 'Денна', 'Новікова Л.Ф.', 'Обліково-аналітичне забезпеченн', 'Б А Н К І В С Ь К І О П Е Р А Ц І Ї', 2021),
	(17, 'Бакалавр', 'Денна', 'Антонова В.Ю.', 'Обліково-аналітичне забезпеченн', 'Ф І Л О С О Ф І Я', 2021),
	(18, 'Бакалавр', 'Денна', 'Книшек О.О.', 'Обліково-аналітичне забезпеченн', 'Ф І Н А Н С О В И Й О Б Л І К І', 2020),
	(19, 'Бакалавр', 'Денна', 'Васильєва В.Г.', 'Обліково-аналітичне забезпеченн', 'Ф І Н А Н С О В И Й О Б Л І К І', 2020),
	(20, 'Бакалавр', 'Денна', 'Книшек О.О.', 'Обліково-аналітичне забезпеченн', 'О Р Г А Н І З А Ц І Я І М Е Т О Д И К А А У Д И Т У', 2020),
	(21, 'Бакалавр', 'Денна', 'Тополенко Н.М.', 'Обліково-аналітичне забезпеченн', 'О Б Л І К І О П О Д А Т К У В А Н Н Я В Г А Л У З Я Х Н А Р О Д Н О Г О Г О С П О Д А Р С Т В А', 2020),
	(22, 'Бакалавр', 'Денна', 'Горбань О.Д.', 'Обліково-аналітичне забезпеченн', 'І Н О З Е М Н А М О В А', 2020),
	(23, 'Бакалавр', 'Денна', 'Дубицький Д.П.', 'Обліково-аналітичне забезпеченн', 'І Н Ф О Р М А Ц І Й Н І С И С Т Е М И І Т Е Х Н О Л О Г І Ї В О Б Л І К У Т А А У Д И Т І', 2020),
	(24, 'Бакалавр', 'Денна', 'Новікова Л.Ф.', 'Обліково-аналітичне забезпеченн', 'Б А Н К І В С Ь К І О П Е Р А Ц І Ї', 2020),
	(25, 'Бакалавр', 'Денна', 'Петруня В.Ю.', 'Обліково-аналітичне забезпеченн', 'М Е Н Е Д Ж Е Н Т', 2020),
	(26, 'Бакалавр', 'Денна', 'Фесенко В.В.', 'Обліково-аналітичне забезпеченн', 'У П Р А В Л І Н С Ь К И Й О Б Л І К', 2019),
	(27, 'Бакалавр', 'Денна', 'Вакульчик О.М.', 'Обліково-аналітичне забезпеченн', 'У П Р А В Л І Н С Ь К И Й О Б Л І К', 2019),
	(28, 'Бакалавр', 'Денна', 'Фесенко В.В.', 'Обліково-аналітичне забезпеченн', 'М І Ж Н А Р О Д Н І С Т А Н Д А Р Т И А У Д И Т У', 2019),
	(29, 'Бакалавр', 'Денна', 'Вакульчик О.М.', 'Обліково-аналітичне забезпеченн', 'АНАЛІЗ ЗВІТНОСТІ СУБ\'ЄКТІВ ГОСПОДАРЮВАННЯ', 2019),
	(30, 'Бакалавр', 'Денна', 'Єдинак Т.С.', 'Обліково-аналітичне забезпеченн', 'ДЕРЖАВНИЙ ФІНАНСОВИЙ КОНТРОЛЬ', 2019),
	(31, 'Бакалавр', 'Денна', 'Васильєва В.Г.', 'Обліково-аналітичне забезпеченн', 'А В Т О М А Т И З А Ц І Я О Б Л І К У', 2019),
	(32, 'Бакалавр', 'Денна', 'Квеліашвілі І.М.', 'Обліково-аналітичне забезпеченн', 'О П О Д А Т К У В А Н Н Я З Е Д', 2019),
	(33, 'Бакалавр', 'Денна', 'Разумей М.М.', 'Обліково-аналітичне забезпеченн', 'У П Р А В Л І Н Н Я В М И Т Н І Й С Л У Ж Б І', 2019),
	(34, 'Бакалавр', 'Денна', 'Онуфрієнко О.Б.', 'Обліково-аналітичне забезпеченн', 'У П Р А В Л І Н Н Я В М И Т Н І Й С Л У Ж Б І', 2019),
	(35, 'Бакалавр', 'Денна', 'Горбань О.Д.', 'Обліково-аналітичне забезпеченн', 'І НО З Е М Н А М О В А З А П Р О Ф. С П Р Я М У В А Н Н Я М', 2019),
	(36, 'Бакалавр', 'Денна', 'Струкуленко А.С.', 'Історія та антропологія права', 'ЕТНОЛОГІЯ', 2022),
	(37, 'Бакалавр', 'Денна', 'Струкуленко А.С.', 'Історія та антропологія права', 'ІСТОРІЯ ПЕРВІСНОГО СУСПІЛЬСТВА', 2022),
	(38, 'Бакалавр', 'Денна', 'Морозов О.В.', 'Історія та антропологія права', 'ВСТУП ДО СПЕЦІАЛЬНОСТІ', 2022),
	(39, 'Бакалавр', 'Денна', 'Колесников К.М.', 'Історія та антропологія права', 'ІСТОРІЯ СТАРОДАВНЬОГО СВІТУ', 2022),
	(40, 'Бакалавр', 'Денна', 'Макушев П.В.', 'Історія та антропологія права', 'ТЕОРІЯ ДЕРЖАВИ І ПРАВА', 2022),
	(41, 'Бакалавр', 'Денна', 'Луценко І.М.', 'Історія та антропологія права', 'ФІЗИЧНЕ ВИХОВАННЯ (СПЕЦПІДГОТОВКА)', 2022),
	(42, 'Бакалавр', 'Денна', 'Корх О.М.', 'Історія та антропологія права', 'ЛОГІКА (ІІ пол.)', 2022),
	(43, 'Бакалавр', 'Денна', 'Морозов О.В.', 'Історія та антропологія права', 'ІСТОР. ТОРГОВ.-МИТНИХ ВІДНОСИН', 2022),
	(44, 'Бакалавр', 'Денна', 'Бобровська О.Ю.', 'Історія та антропологія права', 'Е К О Н О М І К А', 2021),
	(45, 'Бакалавр', 'Денна', 'Гапонова Л.Є.', 'Історія та антропологія права', 'Л А Т И Н С Ь К А М О В А', 2021),
	(46, 'Бакалавр', 'Денна', 'Морозов О.В.', 'Історія та антропологія права', 'І С Т О Р І Я С Е Р Е Д Н І Х В І К І В', 2021),
	(47, 'Бакалавр', 'Денна', 'Сурякова М.В.', 'Історія та антропологія права', 'П С И Х О Л ОГ І Я', 2021),
	(48, 'Бакалавр', 'Денна', 'Запорожченко Ю.В.', 'Історія та антропологія права', 'М Е Т О Д О Л О Г І Я І С Т О Р И Ч Н О Г О Д О С Л І Д Ж Е Н Н Я', 2021),
	(49, 'Бакалавр', 'Денна', 'Черевко А.Д.', 'Історія та антропологія права', 'Ф І З И Ч Н Е В И Х О В А Н Н Я ( С П Е Ц П І Д Г О Т О В К А )', 2021),
	(50, 'Бакалавр', 'Денна', 'Чикольба І.М.', 'Історія та антропологія права', 'Ф І З И Ч Н Е В И Х О В А Н Н Я ( С П Е Ц П І Д Г О Т О В К А )', 2021),
	(51, 'Бакалавр', 'Денна', 'Колесніков К.М.', 'Історія та антропологія права', 'І С Т О Р І Я П О Л І Т И К О - П Р А В О В О Ї Д У М К И', 2021),
	(52, 'Бакалавр', 'Денна', 'Колесніков К.М.', 'Історія та антропологія права', 'І С Т О Р І Я У К Р А Ї Н И', 2021),
	(53, 'Бакалавр', 'Денна', 'Дячок О.О.', 'Історія та антропологія права', 'Д Ж Е Р Е Л О З Н А С Т В О', 2020),
	(54, 'Бакалавр', 'Денна', 'Морозов О.В.', 'Історія та антропологія права', 'ІСТОРІЯ ДОКОЛОНІАЛЬНИХ ЦИВІЛІЗАЦІЙ АФРИКИ ТА АМЕРИКИ', 2020),
	(55, 'Бакалавр', 'Денна', 'Морозов О.В.', 'Історія та антропологія права', 'ІСТОРІЯ НОВОГО ЧАСУ', 2020),
	(56, 'Бакалавр', 'Денна', 'Єфімова І.В.', 'Історія та антропологія права', 'Ю Р И Д И Ч Н А П С И Х О Л О Г І Я', 2020),
	(57, 'Бакалавр', 'Денна', 'Кулько В.А.', 'Історія та антропологія права', 'І Н О З Е М Н А М О В А', 2020),
	(58, 'Бакалавр', 'Денна', 'Запорожченко Ю.В.', 'Історія та антропологія права', 'І С Т О Р І Я Н О В О Г О Ч А С У', 2020),
	(59, 'Бакалавр', 'Денна', 'Колесніков К.М.', 'Історія та антропологія права', 'І С Т О Р І Я У К Р А Ї Н И', 2020),
	(60, 'Бакалавр', 'Денна', 'Учитель І.Б.', 'Історія та антропологія права', 'П Е Д А Г О Г І К А', 2020),
	(61, 'Бакалавр', 'Денна', 'Запорожченко Ю.В.', 'Історія та антропологія права', 'МЕТОДОЛОГІЯ ІСТОРЧНОГО ДОСЛІДЖЕННЯ', 2020),
	(62, 'Бакалавр', 'Денна', 'Онуфрієнко О.Б.', 'Історія та антропологія права', 'УПРАВЛІННЯ В МИТНІЙ СЛУЖБІ', 2019),
	(63, 'Бакалавр', 'Денна', 'Перепьолкін С.М.', 'Історія та антропологія права', 'ОСНОВИ МІЖНАРОДНОГО ПРАВА', 2019),
	(64, 'Бакалавр', 'Денна', 'Дячок О.О.', 'Історія та антропологія права', 'С П Е Ц І А Л Ь Н І І С Т О Р И Ч Н І Д И С Ц И П Л І Н И', 2019),
	(65, 'Бакалавр', 'Денна', 'Літвінов В.В.', 'Історія та антропологія права', 'Е Т И К А Т А Е С Т Е Т И К А', 2019),
	(66, 'Бакалавр', 'Денна', 'Кулько В.А.', 'Історія та антропологія права', 'І Н О З Е М Н А М О В А З А П Р ОФ Е С І Й НИ М СП Р Я М УВ А Н Н Я М', 2019),
	(67, 'Бакалавр', 'Денна', 'Запорожченко Ю.В.', 'Історія та антропологія права', 'І С Т О Р І О Г Р А Ф І Я', 2019),
	(68, 'Бакалавр', 'Денна', 'Колесніков К.М.', 'Історія та антропологія права', 'І С Т О Р І Я Р Е Л І Г І Й', 2019),
	(69, 'Бакалавр', 'Денна', 'Запорожченко Ю.В.', 'Історія та антропологія права', 'І С Т О Р І Я Н О В І Т Н Ь О Г О Ч А С У', 2019),
	(70, 'Бакалавр', 'Денна', 'Разумей М.М.', 'Історія та антропологія права', 'УПРАВЛІННЯ В МИТНІЙ СЛУЖБІ', 2019),
	(71, 'Бакалавр', 'Денна', 'Квеліашвілі І.М.', 'Історія та антропологія права', 'О П О Д А Т К У В А Н Н Я З Е Д', 2019),
	(72, 'Бакалавр', 'Денна', 'Рождественська І.Є.', 'Історія та антропологія права', 'І Н О З Е М Н А М О В А З А П Р ОФ Е С І Й НИ М СП Р Я М УВ А Н Н Я М', 2019),
	(73, 'Бакалавр', 'Денна', 'Тинкован О.В.', 'Прикладна політологія', 'ІСТОРІЯ СУСПІЛЬНО-ПОЛІТИЧНОЇ ДУМКИ', 2022),
	(74, 'Бакалавр', 'Денна', 'Запорожченко Ю.В.', 'Прикладна політологія', 'ІСТОРІЯ УКРАЇНСЬКОЇ ДЕРЖАВНОСТІ ТА КУЛЬТУРИ', 2022),
	(75, 'Бакалавр', 'Денна', 'Калашникова О.Л.', 'Прикладна політологія', 'ПРИКЛАДНА КУЛЬТУРОЛОГІЯ', 2022),
	(76, 'Бакалавр', 'Денна', 'Приймаченко Д.В.', 'Прикладна політологія', 'КОНСТИТУЦІЙНО-ПРАВОВІ ЗАСАДИ ПУ ', 2022),
	(77, 'Бакалавр', 'Денна', 'Марценюк О.О.', 'Прикладна політологія', 'ВСТУП ДО СПЕЦІАЛЬНОСТІ', 2022),
	(78, 'Бакалавр', 'Денна', 'Нестеренко О.М.', 'Прикладна політологія', 'ФІЗИЧНЕ ВИХОВАННЯ (СПЕЦПІДГОТОВКА)', 2022),
	(79, 'Бакалавр', 'Денна', 'Макушев П.В.', 'Прикладна політологія', 'ТДП (ІІ пол.)', 2022),
	(80, 'Бакалавр', 'Денна', 'Корх  О.М.', 'Прикладна політологія', 'ФІЛОСОФІЯ', 2022),
	(81, 'Бакалавр', 'Денна', 'Склянська О.В.', 'Прикладна політологія', 'ПРИКЛАДНА ПСИХОЛОГІЯ', 2022),
	(82, 'Бакалавр', 'Денна', 'майстерня художника Сосни В.І.', 'Графічний дизайн', 'ОСНОВИ КОЛЬОРОЗНАВСТВА (ЗА ВИДАМИ ДИЗАЙНУ)', 2022),
	(83, 'Бакалавр', 'Денна', 'майстерня художника Сосни В.І.', 'Графічний дизайн', 'ОСНОВИ РИСУНКУ, ЖИВОПИСУ ТА ПЛАСТИЧНОЇ АНАТОМІЇ', 2022),
	(84, 'Бакалавр', 'Денна', 'майстерня художника Сосни В.І.', 'Графічний дизайн', 'ОСНОВИ РИСУНКУ…', 2022),
	(85, 'Бакалавр', 'Денна', 'Калашникова О.Л.', 'Графічний дизайн', 'ІСТОРІЯ КУЛЬТУРИ І МИСТЕЦТВ', 2022),
	(86, 'Бакалавр', 'Денна', 'Запорожченко Ю.В.', 'Графічний дизайн', 'ІСТОРІЯ УКРАЇНСЬКОЇ ДЕРЖАВНОСТІ', 2022),
	(87, 'Бакалавр', 'Денна', 'Антонова В.Ю.', 'Графічний дизайн', 'ФІЛОСОФІЯ', 2022),
	(88, 'Бакалавр', 'Денна', 'Луценко І.М.', 'Графічний дизайн', 'ФІЗИЧНЕ ВИХОВАННЯ (СПЕЦПІДГОТОВКА)', 2022),
	(89, 'Бакалавр', 'Денна', 'Гапонова Л.Є.', 'Графічний дизайн', 'ДІЛОВА УКРАЇНСЬКА МОВА', 2022),
	(90, 'Бакалавр', 'Денна', 'Небаба Н.О.', 'Графічний дизайн', 'ВСТУП ДО СПЕЦІАЛЬНОСТІ', 2022),
	(91, 'Бакалавр', 'Денна', 'Небаба Н.О.', 'Графічний дизайн', 'СУЧАСНІ ІНФОРМАЦІЙНІ ТЕХНОЛОГІЇ ', 2022),
	(92, 'Бакалавр', 'Денна', 'Луценко І.М.', 'Графічний дизайн', 'ФІЗИЧНЕ ВИХОВАННЯ (СПЕЦПІДГОТОВКА)', 2022),
	(93, 'Бакалавр', 'Денна', 'Калашникова О.Л.', 'Експертиза культурних цінностей', 'ВСТУП ДО СП. (І пол.)', 2022),
	(94, 'Бакалавр', 'Денна', 'Калашникова О.Л.', 'Експертиза культурних цінностей', 'ІСТОР. КУЛЬТ. (ІІ пол.)', 2022),
	(95, 'Бакалавр', 'Денна', 'Дашко Н.С.', 'Експертиза культурних цінностей', 'ДІЛ.УКР.МОВА (ІІ пол.)', 2022),
	(96, 'Бакалавр', 'Денна', 'Літвінов В.В.', 'Експертиза культурних цінностей', 'ФІЛОСОФІЯ ТА ФІЛОСОФІЯ КУЛЬТ.', 2022),
	(97, 'Бакалавр', 'Денна', 'Калашникова О.Л.', 'Експертиза культурних цінностей', 'ІСТОРІЯ КУЛЬТУРИ', 2022),
	(98, 'Бакалавр', 'Денна', 'Колесников К.М.', 'Експертиза культурних цінностей', 'ІСТОРІЯ УКРАЇНИ', 2022),
	(99, 'Бакалавр', 'Денна', 'Луценко І.М.', 'Експертиза культурних цінностей', 'ФІЗИЧНЕ ВИХОВАННЯ (СПЕЦПІДГОТОВКА)', 2022),
	(100, 'Бакалавр', 'Денна', 'Гапонова Л.Є.', 'Експертиза культурних цінностей', 'ЛАТИНСЬКА МОВА', 2022),
	(101, 'Бакалавр', 'Денна', 'Літвінов В.В.', 'Експертиза культурних цінностей', 'ФІЛОСОФІЯ ТА ФІЛОСОФІЯ КУЛЬТ.', 2022),
	(102, 'Бакалавр', 'Денна', 'Погребняк А.В.', 'Експертиза культурних цінностей', 'СУЧАСНІ ІНФОРМАЦІЙНІ ТЕХНОЛОГІЇ', 2022);
/*!40000 ALTER TABLE `subject` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
